{
    "destination": "Krabi",
    "country": "Thailand",
    "time": "November 2018",
    "intro": "My wife and I started on our first travel-together as husband and wife in November 2018, at Krabi, Thailand. Krabi is a beautiful island, great if you like beaches and clear ocean water. Besides beaches, there are a few other tourism spots which can be interesting, such as the Tiger Cave Temple and the Blue Lagoon. We stayed in Krabi for about 4 days and three nights, although only two of those days were filled with activities. We took a wedding package from a travel agency called D Asia Travels whom we paid quite a reasonable amount.",
    "transport": "Prior of the flight, we parked our car at the Long Term Car Park (LTCP), and paid about RM32 per day. We then took a shuttle bus which drove us right in front of the KLIA. We flew with Air Asia, as the tickets were puchased by my fellow friends as wedding gift. Thank you again guys! The flight was smooth and not too long. Food and beverages served was also quite nice, although you do need to purchase them in advance during ticket check-out. Upon arrival, we were greeted by a tour guide, who helped drive us to the hotel. We stayed at the Cha Da Resort.",
    "accommodation": "The hotel was also nice, with a beautiful view of the ocean. The initial decoration was also adorable, as you could see from the image below. Meals were included in our package, all of which tasted great and neither of us suffered from sickness or food poisoning.",
    "day1": "The first day was mainly spent on settling down and chilling in the hotel room. Only on the second and third days were filled with actitvities. On our first 'activity' day, we spent most of our day on a long island hopping session. We got onto a boat with the other tourists, and the tour guide brought us to a few different islands, one of which is the famous Phi Phi Island. To me, the island hopping was a tad bit too long as I was almost getting sea sick (I do not normally get sea sick) after being on the boat for almost the whole day. Nevertheless, activities varied from island to island, from snorkeling to open water swimming (floats were provided for those who cannot swim), which made things a little less boring. Cut the time spent on the boat my half, and the island hopping would otherwise be much more exciting.",
    "day2": "On the second Activity day, we (and other tourists) took the minivan to visit a few travel spots away from the beach. First we went to the Blue Lagoon. To get there, we had to walk for quite a few miles, so if you decide to come here, make sure to put on some comfortable pairs of sneakers. Before reaching the Blue Lagoon, you will pass by the Emerald Pool, in which people can take a dip and chill. At the time of our visit, there were too many people in the pool, hence we did not swim and proceeded to walk a little further to see the Blue Lagoon. The Blue Lagoon gave us the creeps as we were warned not to swim in it, which nobody did, due to the quicksand on the floor of the pool. Next, we went to the Tiger Cave Temple. It is a huge temple, where you could attempt to climb up the 184-(tall)step stair case. We only climbed about a quarter but was worried we could not get back down in time, since the tour guide gave us limited time here, so we climbed back down and had some ice cream instead. Note that there are monkeys roaming around too. Later that night, we had our candle light dinner, served by the hotel, also part of our package. The meal was very nice, but two things to note are: 1) It was literally candle-lit, hence we were having trouble seeing our food. 2) There were just too many mosquitoes. That being said, it was indeed a pleasant experience.",
    "conclusion": "Overall, we certainly had an unforgettable experience, as this was our first ever travel together. Alhamdulillah, we were healthy throughout the trip, and no bad incident happened. To be honest, I was particularly careful with the food that we eat throughout our time here, as I know a few people who went to Thailand and suffered bad food poisoning. Hence, for those of you that plan to go to Krabi or any other place in Thailand, be mindful of what you eat and I would not recommend eating too much street food. On the fourth day, we took our flight back home and headed to our next destination: Port Dickson!"
}