{
    "header": {
        "title": "If It Fits Your Macros (IIFYM)",
        "text": "For those that actually want to commit themselves to a real diet plan, one of the many known and effective diet plans out there is the If It Fits Your Macros (IIFYM). IIFYM is a relatively flexible plan that could help you achive your goals without feeling overly restricted. IIFYM is being used widely all over the world today for fat loss, bulking and maintenance. It keeps track only of your daily calorific consumption, and the the amount of the macronutrients consumed; Carbohydrates, Protein and Fat. This allows the dieter to customise his/her daily meals as much as he wants, as long as those four things are on track. Over the years, there have been arguments of whether dieters should include fast food and/or junk food in their plans as well. I would suggest NOT to on a daily basis, but you could add a few 'dirty' meals here and there if you are really craving for it, again, while keeping those numbers on track. IIFYM has been go to for many years, due to its effectiveness and flexibility. The first time I did this diet I became really lean (see my Transformation page), and felt as if I had found the golden secret knowledge of fat loss. That being said, other diet plans such as Keto and Paleo have also been used by many athletes, hence feel free to give them a try if you want (of course, after consulting your Physician)."
    },
    "keyidea": {
        "title": "Key Concepts",
        "text": "The key idea is to know the calorific value of each and every thing that goes inside your body - food, drinks, sweets, snacks, fruits, all of them. As the dieter calculates his daily calorific requirements and the amount of macronutrients needed, he would then plan each and every meal of his day. Once this meal plan is done, the dieter ONLY EATS WHAT WAS PLANNED. This sounds quite challenging but it would not be (especially at the start) if you really understand how to change your daily calorific intake as you progress each week, gradually bringing it up or down to make it work towards the desired results. If, let's say the dieter breaks this plan, he would then proceed with recalculation of the remaining calories for the day. For example, if a dieter has Meal A planned for Monday's lunch, but instead he went out with his friends to have lunch at some restaurant, he would then need to recalculate how much calories are left for him to consume for the rest of that Monday - the total amount of calories and macronutrients consumed each day stays the same, hence, the name If It Fits Your Macros. IIFYM's idea of only eating what was planned provides many benefits. 1) Prevents hunger. 2) You only eat what you need, therefore preventing wasting of food by overeating. 3) You learn how to substitute calorie bombs with their alternatives. and so on. In this page we will review how to calculate your initial calories, how to calculate your target calories, and how to progress though from each of these calorific values the right way. Finally I will explain if taking protein powder is a good idea."
    },
    "calorie": {
        "title": "How to calculate my daily calorie requirement?",
        "link": "https://tdeecalculator.net",
        "text": "The scientific term for 'daily calorie requirement' is known as Total Daily Energy Expenditure (TDEE). TDEE is calculated by taking essential information such as gender, weight, height, and daily activies and plug them into a mathematical formula which gives the (estimated) total number of required calories as result. There are a few known formulas that are being used for this purpose, each with their own pros and cons. However, to me, it does not really matter. You just need to know how much calories your need INITIALLY- before the diet begin. If you feel that the formula produced a number which is too low for you, you may increase and adjust the given number accordingly. The INITIAL TDEE is important but adjustable, considering there are various formulas that could be used to calculate it, and the results of each would of course differ slightly from each other. You can visit the link in Read More above for one of the many websites out there that could help you calculate your TDEE. Once you have calculated and firmly decided you INITIAL TDEE, you may proceed by calculating your TARGET TDEE. To gain weight, you add 500 to your initial TDEE. For fat loss, you DEDUCT 500 from your TDEE. For maintenance, you do not need to add or subtract anything, i.e. Target TDEE = Initial TDEE. For Lean Bulking, Target TDEE should be Initial TDEE + 10% of Initial TDEE. IMPORTANT: Now, the biggest mistake people usually make is jump straight right into Target TDEE on week 1. DO NOT DO THIS. Reasons: 1) You do not even know if what you eat on a daily basis matches your Initial TDEE. 2. You may experience terrible hunger and end up giving up. Please read on the Designing Your Meal Plan the Right Way section of this page, as you will learn how to properly use these numbers you have just calculated; Initial TDEE and Target TDEE."
    },
    "macro": {
        "title": "How to calculate my macros?",
        "link": "https://www.healthline.com/nutrition/iifym-guide#calculating-your-macros",
        "text": "Please visit the link I provided above to learn more on how to calculate your daily requirement of macronutrients. The first thing to calculate is your Protein. Generally, you may have heard this many times, which is to consume 1g of Protein per pound of body weight. For example, if you weight 200lbs, you should consume 200g of Protein a day. However, I find that many people do not understand that this formula is generally for younger individuals who train in the gym at least 2-3 times a week, with each session being moderate to high intensity. If you do not have such lifestyle, or only train twice a week during which you barely sweat, you should not go for this formula. Instead, there are sources that suggest protein intake may vary from person to person again, based on age. Recommended intake (as per mentioned by the website I referenced above) is 0.7-1.0g of Protein per pound of body weight. Some also suggest 1.0g per pound of LEAN body weight. Lean body weight is your body weight minus your fat percentage multiplied by your body weight. Next, you should proceed by calculating your fat. Recommended intake for fat is 0.25-4.0g per pound of body weight. Finally, you shall fill up the remaining calories with carbohydrates."
    },
    "design": {
        "title": "Designing Your Meal Plan the Right Way",
        "link": "https://www.bodybuilding.com/fun/macronutrients_calculator.htm",
        "text": "Now that your have your Initial TDEE, Target TDEE, and your required macronutrients, it is time to craft your meal plan. You may add time frame if it helps, such as 12-week or 16-week, but the best way would be to design something you could practise beyond years of your life. In structuring your meals, choose foods that are nutritious and non-processed. Visit my General Diet page to read about healthy foods, different types of carbs, and foods to avoid. Now, the key to consistency is VARIETY. Hence, CHANGE YOUR MEALS from time to time to keep your motivation fresh and fueled. I would recommend changing the meal plan every 2-3 weeks. So how do you progress through the weeks? First, always start with your Initial TDEE on the first 1-2 weeks. This is because we do not know if your daily caloric intake matches the calculated TDEE. You may have been consuming lower or higher calories than your calculated Initial TDEE. Consider these first few weeks to sort of like re-adjust your body to a more consistent way of eating. Once you have reached the second or third week with the Initial TDEE, and feel good and healthy, you may reduce/increase (depending on your goal) your total caloric intake by at most 150 for the next 1-2 weeks - we are still not yet reached the target TDEE. In the upcoming week, reduce/increase further by at most 150. Repeat until you have reduced/increased your caloric intake to your Target TDEE. Stay there for 4-8 weeks. During this period, you may have to recalculate your TDEE and macros due to changes in your body weight. Stay as long as you want but remember NOT to go beyond your Target TDEE. Most people make the mistake of going beyond the Target TDEE, causing them not to lose fat/gain muscle, but gaining more fat instead. For fat loss, you may add ONE cheat meal (or cheat day if you are less serious) every 7-8 days where you could raise up your daily caloric intake up to Initial TDEE + 500. For example, if your Initial TDEE is 2500 and your Target TDEE is 2000, in the 8th week you may have a cheat meal or cheat day that brings your caloric intake for the day to up to 2500+500=3000. On days you (accidentally) go out of control and consume 5000 calories, you should add more cardio sessions (on a daily basis) to bring back your progress on track. For example, if you are supposed to consume 2000 calories for the day, but on a party you ended up eating 5000 calories, you would have an access of 5000-2000 = 3000 calories. Split this number up to several days, lets say 10 days, and do some cardio exercise to burn at least 3000/10=300 calories per session."
    },
    "supplements": {
        "title": "Are protein powder any good?",
        "link": "https://www.nhs.uk/live-well/healthy-body/body-building-sports-supplements-facts/",
        "text": "Being one of those people who occassionally train in the gym, I very much understand the awesomeness of ending your workouts with a fresh and cold shaker bottle of chocolate-flavored Whey protein. This effect may also be amplified if you are a beginner in the gym (at least that was how it was for me). As you go home, chill, and approach bedtime, you go on to make another fresh and cold shaker bottle of Casein protein. For those who are looking to break free from the Prision of Skinniness, you may have also tried various brands of Mass Gainers. Protein powder supplements have been a huge business in the fitness industry. The problem is, that is indeed, essentially what they are; a business. Taking advantage of famous athletes and Mr Olympia winners, protein powder manufacturers use them to attract buyers and give the famous (but false) idea of; this protein powder was used by athlete A which contributes to his ripped physique. People do not realise that these athletes consume 6-8 (sometimes more) high protein meals every day. Besides that, these athletes attained their physique way before they became ambassadors to those protein powder brands. While protein powder MAY have muscle building benefits, it is still not designed to replace any meal. After all, they are called 'supplements'; it is meant to be consumed IN ADDITION to solid foods. Hence, if you still however, plan to include protein supplement in your meal plan, you need to include their calories in but exclude the protein(g) out, since those Protein macro you calculated must come from SOLID foods. Furthermore, there are also evidence that show consuming too much protein may lead to kidney problems. For those who are taking mass gainers, try to eat more solid foods- it tastes much better!"
    },
    "closure": "The IIFYM provides a flexible yet effective way of shredding off fat and gaining lean muscle mass. You begin by calculating your Initial and Target TDEEs, then your macronutrient requirements. With these numbers, your craft your own meal plan, in which you can choose essentially any food you want, as long as It Fits Your Macros, although you should include more solid and nutritious foods and avoid processed and fast foods. Most importantly, be aware that no diet is perfect and IIFYM may have some drawbacks as well. Be sure to do your homework and research to educate yourself sufficiently before engaging in any of the available diet plans out there- be it Keto, IIFYM or any other. Most importantly, consult your physician or local doctor before committing yourself to any diet plans, as each of them certainly have the possibility to affect your wellbeing and health."
}