{
    "header": {
        "title": "If It Fits Your Macros (IIFYM)",
        "text": "Getting just the right nutrition can be a bit tricky, given that each person's body have varying compositions - people differ in weight, height, age, etc. Besides that, the total number of calories required by each person also differs based on his/her daily activities. Those who practise a more demanding lifestyle, such as having a job which requires the person to climb the stairs multiple times every day, or if he/she works as a professional athlete, generally requires more energy to get through the day, and hence are allowed to eat more than a person who, say, only works at a desk job from 9-5. Because of this, there is no one specific diet plan in the planet that could fit everyone. Yep, most diet plans are customised, based on the person's body type, age, height, daily activities, frequency of exercise, and so on. Hence, unless you hire a personal/online trainer to do it for you, to properly 'craft' an exclusive diet plan for yourself, you need to do a whole bunch of calculations on how much to eat, what to eat, and when. Nevertheless, throughout my years of training, I learned that this 'calculative' diet is certainly not for everyone - its only for those who would really like to commit and bring their physique to the next level (such as leaning down, lean bulk, etc.). Most people however, could not care less about having a 6-pack abs, or a 10% body fat - all they want is to just stay healthy, and eat healthy. In this page, we will be looking at how to get decent nutrition, without making those calculations, primarily aimed for average and working individuals."
    },
    "keyidea": {
        "title": "Key Concepts",
        "text": "The main idea of a decent nutrition is to consume just enough calories for you to get through the day. As mentioned, the more active you are on a daily basis, the more energy you need and hence the more food you need to eat (up to a certain point of course). This includes the number of exercise sessions per week, and not just that, but how INTENSE each of those sessions are. If you train three times a week but during each training you are being pushed for more than 2 hours, you obviously require more energy than the person that ALSO trains three times a week, but all he does is walk on the treadmill for 15 minutes. This is the harsh reality that people need to understand - your workout matters, but the intensity of those workouts also matters. As you read on you will learn about how much to eat, how to estimate your macros, how to portion the food on your plate, and what food/beverages to avoid. Since I am Malaysian, I will be making references to many Malaysian food/beverages such as Nasi Lemak, Teh Tarik, and Roti Canai."
    },
    "calorie": {
        "title": "How would I know my daily caloric requirement?",
        "link": "https://www.webmd.com/diet/features/estimated-calorie-requirement",
        "text": "Before you read on, be sure to read more regarding this topic by clicking on the Read More link above. Generally, as mentioned, total caloric requirements differ from person to person based on various factors, such as gender, age, weight, height and physical lifestyle. Referring to the article in the link, men aged 19-30 who practise sedentary lifestyle requires around 2400 calories per day, while those who practice a moderately active to active lifestyles require somewhere around 2600-3000 calories per day. Whilst for women aged 19-30, 2000 calories are needed for sedentary lifestyle, and around 2000-2400 calories are required for moderately active to active lifestyles. 'But how would I know the calories of the food that I'm consuming?' It is as simple as taking your phones out and Google-searching something like 'Double Cheeseburger calories' and you will get your answer. It is your own responsibility to know the things that you put inside your body, hence you should always make it a habit of looking up the caloric values of your foods (and drinks) before or after your meal. Note that you only need to look the numbers up just the first few times, since most of us eat pretty much almost the same foods everyday. Below are some of the calorific values of common foods in Malaysia to give you a rough idea on if you are consuming too much calories in a day (and wondering how you have gained weight since the last time you saw yourself in a photo). Now that these numbers are rough estimates only, and values obtained from multiple online sources including Google Search, MyFitnessPal, and FatSecret."
    },
    "macro": {
        "title": "How would I calculate my macros?",
        "link": "https://www.nhs.uk/live-well/eat-well/the-eatwell-guide/",
        "text": "The link I provided above gives an overall insight on how to eat well without going through the troubles of calculating the calories and macronutrients of each of your meal. Due to the image presented in that link being owned by NHS UK, I should not use their image in my site. Basically, the majority of the food you consume everyday should be from the Fruits and Vegetables, and the Carbohydrates circular sectors. For carbohydrates, I would suggest whole-grain sources, such as wholemeal pasta and brown rice as they are generally lower in glycemic index (GI), meaning that they are more slowly digested, causing a smaller rise in blood glucose level, which usually, leading to lesser insulin release as well. If you do not already know, carbohydrates are broken down to their simplest form, called glucose, when they are being digested. Therefore, as you eat any carbohydrate food, the sugar (glucose) level increases in your blood. If you eat refined carbohydrate foods (such as white rice, cakes, doughnuts etc.) the high GI nature of these foods will cause a spike in glucose level in your blood. To stabilise this spike, the body releases insulin to bring the levels back downs to a more stable state. This is generally a bad thing, since releasing huge amounts of insulin may strain and over time cause damage to the organ which produces it, known as the Pancreas. Include also moderate amounts of protein sources in your diet, such as poultry (chicken, fish, beef, etc), beans and eggs, and dairy products such as milk and cheese. Finally, keep the intake of oily and deep dried foods which contain high amounts of butter and oil low. Also remember to choose Unsaturated fats over saturated."
    },
    "design": {
        "title": "Designing A Diet Plan for Weight Loss, Weight Gain, and Maintenance.",
        "link": "https://www.nhs.uk/live-well/eat-well/the-eatwell-guide/",
        "text": "The link I provided above gives an overall insight on how to eat well without going through the troubles of calculating the calories and macronutrients of each of your meal. Due to the image presented in that link being owned by NHS UK, I should not use their image in my site. Basically, the majority of the food you consume everyday should be from the Fruits and Vegetables, and the Carbohydrates circular sectors. For carbohydrates, I would suggest whole-grain sources, such as wholemeal pasta and brown rice as they are generally lower in glycemic index (GI), meaning that they are more slowly digested, causing a smaller rise in blood glucose level, which usually, leading to lesser insulin release as well. If you do not already know, carbohydrates are broken down to their simplest form, called glucose, when they are being digested. Therefore, as you eat any carbohydrate food, the sugar (glucose) level increases in your blood. If you eat refined carbohydrate foods (such as white rice, cakes, doughnuts etc.) the high GI nature of these foods will cause a spike in glucose level in your blood. To stabilise this spike, the body releases insulin to bring the levels back downs to a more stable state. This is generally a bad thing, since releasing huge amounts of insulin may strain and over time cause damage to the organ which produces it, known as the Pancreas. Include also moderate amounts of protein sources in your diet, such as poultry (chicken, fish, beef, etc), beans and eggs, and dairy products such as milk and cheese. Finally, keep the intake of oily and deep dried foods which contain high amounts of butter and oil low. Also remember to choose Unsaturated fats over saturated."
    },
    "supplements": {
        "title": "Are protein shakes any good?",
        "link": "https://www.healthline.com/nutrition/20-foods-to-avoid-like-the-plague",
        "text": "Up to this point, we have taken a look at generally how much calories we should consume in a day, along with what types of foods to look for. Though it is important to know what to eat or drink, knowing what NOT to consume is equally as important. The first type of food to avoid is what we normally refer to as Calorie/Sugar Bombs. Calorie Bombs are foods that are high in calories, high glycemic index but provide very small nutritional value. Besides that, calorie bomb foods do not make the consumer feel 'full', hence requires the eater to eat more of it, to at least feel 'satisfied'. Examples of calorie bombs include Pop-Corn (especially the ones coated with caramel or other forms of simple sugars), candies, cakes, pastries and the like. It is also important to note that the rule also applies for drinks. Most drinks are loaded with sugar, no matter what their advertised nutrional value may be - including powedered 'energy' drinks, juices, carbonated drinks, Teh Tarik, Teh Ais. For manufactured products, be mindful of their sugar content (normally labelled at the back of their boxes), while paying close attention to the % of 'suggested daily intake' (also normally labelled on the box). For example, let's say product A contains 28g of sugar per serving. Along with this information, there should be something like '26% of suggested intake of an average adult' written somewhere as well. This information is essential to the consumer, as you get to be aware that by taking only 1 serving of this product, you are basically taking in a whopping 26% of your suggested daily sugar intake. Moreover, you should also avoid any type of junk food and fast food, as they contain high amounts of god-knows-what chemicals, which may be bad for the body. A good rule of thumb for me is: if I do not know what this is made of, then it should not be good for me. You may or may not avoid these foods completely, depending on your previous eating habits. For me, having some of these foods is okay, though it should be no more than twice a week."
    },
    "closure": "I believe we could all agree that, maintaing healthy eating habits is much more difficult than we thought, especially if you live in Malaysia, where most foods are either heavy with refined-carbohydrates, or loaded with sugar. Though our delicious foods may be something we could be proud of, it is also essential for each and everyone of us to look after ourselves, particularly our health and well being. One way of approaching a more healthy eating habit is to start slow. Start with eating clean once a week. Then try twice a week, and so on, until we could practice healthy eating for at least five out of the seven days in a week. That being said, diet alone would not help you stay fit and healthy, as diet and exercise come together hand-in-hand. If you are clueless on what workouts to do, or what program to try, visit my workout programs pages to learn just a thing or two."
}