{
    "title": "Participation in Various Race Events",
    "time": "2014-2018",
    "intro": "Given my highly-inactive lifestyle since my younger days, long distance running always seemed like an impossible task for me. In fact, running for 1 mile (1.5 KM) was enough to put myself at a complete fatigue. Nevertheless, as I grew older and began exposing myself to more cardiovascular-intensive workouts, I finally decided to get involved in long distance running events. The first of these events was the Cyberjaya Twin City Marathon, organised back in 2014, in which I took part in the 14KM category with my friends. It was indeed such a huge achievement for me as I was able to run 14KMs without stopping to catch a breath. I then proceeded to train and participate for a more challenging event, which was the Standard Chartered Half Marathon (21KM) in 2016.",
    "main1": "The Viper challenge was an obstacle run event in  which there are two categories: 5KM and 11KM. Yasmin and I took part in the 5KM category, having to go through a total of 6 obstacles. It was fun overall and can get tough if you are not good with pullups (which I was hehe).",
    "main2": "My wife and I also took part in the 5KM category of Color Run organised by CIMB in 2017. It was not much for the challenge but more for the fun of it. Overall, it was alright.",
    "main3": "The SCHKM certainly tested the peak of my long distance running capability. Being someone who trains muscle strength and hypertrophy, hitting that endurance muscle fibers definitely gave me a painful yet satisfying experience. For training we were doing 40-50 rounds of 400m lap, something I never even thought possible for myself. Credits also go to Yasmin who also agreed to train and participate for the half marathon.",
    "closure": "Overall, participating in these running events expose myself to never-before-known limits of my body. I never knew I could run 14KM until I started training for the TwinCity event in Cyberjaya, and running 40 laps of 400m track was undoubtedly out of my mind. I would have gone for a full marathon somewhere along the line, but for now, I am more than happy with what I have achieved(with an injured knee)."
}